### 第2章: UNIXコマンド

popular-names.txtは，アメリカで生まれた赤ちゃんの「名前」「性別」「人数」「年」をタブ区切り形式で格納したファイルである．以下の処理を行うプログラムを作成し，popular-names.txtを入力ファイルとして実行せよ．さらに，同様の処理をUNIXコマンドでも実行し，プログラムの実行結果を確認せよ．

`!mkdir -p data/chapter2 && wget -P data/chapter2 https://nlp100.github.io/data/popular-names.txt`

### 10. 行数のカウント
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [39]:
import pandas as pd
df = pd.read_table('./data/chapter2/popular-names.txt', header=None, sep='\t', names=['name', 'sex', 'number', 'year'])
len(df)

2780

In [4]:
!wc data/chapter2/popular-names.txt

 2780 11120 55026 data/chapter2/popular-names.txt

### 11. タブをスペースに置換
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [14]:
!echo '** Using sed'
!sed 's/\t/ /g' ./data/chapter2/popular-names.txt | head -n5

!echo '** Using expand'
!expand -t 1 ./data/chapter2/popular-names.txt | head -n5

** Using sed
Mary F 7065 1880
Anna F 2604 1880
Emma F 2003 1880
Elizabeth F 1939 1880
Minnie F 1746 1880
sed: couldn't write 17 items to stdout: Broken pipe
** Using expand
Mary F 7065 1880
Anna F 2604 1880
Emma F 2003 1880
Elizabeth F 1939 1880
Minnie F 1746 1880
expand: write error: Broken pipe
expand: write error

## 12. 1列目をcol1.txtに，2列目をcol2.txtに保存

各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [44]:
df['name'].to_csv("data/chapter2/col1.txt", index=False)
df['sex'].to_csv("data/chapter2/col2.txt", index=False)

In [23]:
!cut -f 1 data/chapter2/popular-names.txt > data/chapter2/col1.txt && cat data/chapter2/col1.txt | head -n5
!cut -f 2 data/chapter2/popular-names.txt > data/chapter2/col2.txt && cat data/chapter2/col2.txt | head -n5

Mary
Anna
Emma
Elizabeth
Minnie
F
F
F
F
F

### 13. col1.txtとcol2.txtをマージ
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [47]:
col1 = pd.read_table('data/chapter2/col1.txt')
col2 =  pd.read_table('data/chapter2/col2.txt')
df = pd.concat([col1, col2], axis=1)
df.to_csv('col1_2.txt', index=False)

In [29]:
!paste data/chapter2/col[1-2].txt > data/chapter2/col1_2.txt

### 14. 先頭からN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [55]:
df = pd.read_table('data/chapter2/popular-names.txt', header=None, names=['name', 'sex', 'number', 'year'])
df.head(5)

        name sex  number  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [32]:
!head -n5 data/chapter2/popular-names.txt

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880

### 15. 末尾のN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [56]:
df = pd.read_table('data/chapter2/popular-names.txt', header=None, names=['name', 'sex', 'number', 'year'])
df.tail(5)

          name sex  number  year
2775  Benjamin   M   13381  2018
2776    Elijah   M   12886  2018
2777     Lucas   M   12585  2018
2778     Mason   M   12435  2018
2779     Logan   M   12352  2018

In [57]:
!tail -n5 data/chapter2/popular-names.txt

Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

### 16. ファイルをN分割する
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [6]:
import numpy as np
import pandas as pd
df = pd.read_table('data/chapter2/popular-names.txt', header=None, names=['name', 'sex', 'number', 'year'])
np.array_split(df, 3)

[          name sex  number  year
 0         Mary   F    7065  1880
 1         Anna   F    2604  1880
 2         Emma   F    2003  1880
 3    Elizabeth   F    1939  1880
 4       Minnie   F    1746  1880
 ..         ...  ..     ...   ...
 922      Betty   F   32964  1926
 923      Helen   F   26884  1926
 924   Margaret   F   23070  1926
 925       Ruth   F   20223  1926
 926      Doris   F   16298  1926

 [927 rows x 4 columns],
              name sex  number  year
 927      Virginia   F   16162  1926
 928       Mildred   F   13551  1926
 929       Frances   F   13355  1926
 930        Robert   M   61130  1926
 931          John   M   56110  1926
 ...           ...  ..     ...   ...
 1849       Nicole   F   15752  1972
 1850      Michael   M   71405  1972
 1851  Christopher   M   52189  1972
 1852        James   M   47083  1972
 1853        David   M   46366  1972

 [927 rows x 4 columns],
           name sex  number  year
 1854      John   M   43181  1972
 1855    Robert   M   43037  1972
 1856     Jason   M   37446  1972
 1857     Brian   M   36322  1972
 1858   William   M   30529  1972
 ...        ...  ..     ...   ...
 2775  Benjamin   M   13381  2018
 2776    Elijah   M   12886  2018
 2777     Lucas   M   12585  2018
 2778     Mason   M   12435  2018
 2779     Logan   M   12352  2018

 [926 rows x 4 columns]]

In [10]:
!split -l 1000 -d ./data/chapter2/popular-names.txt

###  17. １列目の文字列の異なり
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [13]:
import pandas as pd

df = pd.read_table('data/chapter2/popular-names.txt', header=None, names=['name', 'sex', 'number', 'year'])
df['name'].drop_duplicates()

0            Mary
1            Anna
2            Emma
3       Elizabeth
4          Minnie
          ...
2738       Elijah
2747       Amelia
2754        Logan
2758       Oliver
2777        Lucas
Name: name, Length: 136, dtype: object

In [15]:
!cut -f 1 ./data/chapter2/popular-names.txt | sort | uniq | wc -l

136

### 18. 各行を3コラム目の数値の降順にソート
 各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [21]:
import pandas as pd
df = pd.read_table('data/chapter2/popular-names.txt', header=None, names=['name', 'sex', 'number', 'year'])

df.sort_values(by='number', ascending=False).head(5)

         name sex  number  year
1340    Linda   F   99689  1947
1360    Linda   F   96211  1948
1350    James   M   94757  1947
1550  Michael   M   92704  1957
1351   Robert   M   91640  1947

In [24]:
!cat data/chapter2/popular-names.txt | sort -rk 3 | head -n5

Linda	F	99689	1947
James	M	9951	1911
Mildred	F	9921	1913
Mary	F	9889	1886
Mary	F	9888	1887

### 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [25]:
import pandas as pd
df = pd.read_table('data/chapter2/popular-names.txt', header=None, names=['name', 'sex', 'number', 'year'])
df.value_counts('name')

name
James      118
William    111
Robert     108
John       108
Mary        92
          ...
Laura        1
Tracy        1
Carolyn      1
Kelly        1
Walter       1
Name: count, Length: 136, dtype: int64

In [27]:
!cut -f 1 ./data/chapter2/popular-names.txt | sort | uniq -c | sort -r | head -n5

    118 James
    111 William
    108 Robert
    108 John
     92 Mary